[Killed] Logical mutation
red/PensieCalculator/PensieLib/PensieLib.cs:12:21
         public static double CalculPensie(int varstaCurenta, int salariuLunar, int aniCotizati, double crestereAnualaSalariu)
             {
                 //conditie compusa
-                if (varstaCurenta < 0 || salariuLunar < 0 || aniCotizati < 0 || crestereAnualaSalariu <0) 
+                if (varstaCurenta < 0 || salariuLunar < 0 || aniCotizati < 0 && crestereAnualaSalariu <0) 
                     throw new ArgumentException("Parametrii invalizi.");
                 
killedBy: PensieTests.CalculatorPensieTests.EP1_VarstaNegativa; PensieTests.CalculatorPensieTests.EP2_SalariuNegativ; PensieTests.CalculatorPensieTests.EP3_AniCotizatiNegativi

[Killed] Equality mutation
red/PensieCalculator/PensieLib/PensieLib.cs:12:62
         public static double CalculPensie(int varstaCurenta, int salariuLunar, int aniCotizati, double crestereAnualaSalariu)
             {
                 //conditie compusa
-                if (varstaCurenta < 0 || salariuLunar < 0 || aniCotizati < 0 || crestereAnualaSalariu <0) 
+                if (varstaCurenta < 0 || salariuLunar < 0 || aniCotizati > 0 || crestereAnualaSalariu <0) 
                     throw new ArgumentException("Parametrii invalizi.");
                 
killedBy: PensieTests.CalculatorPensieTests.EP3_AniCotizatiNegativi; PensieTests.CalculatorPensieTests.EP5_VarstaPensionareExacta_AniRamasi0; PensieTests.CalculatorPensieTests.EP6_PestePensionare_AniRamasiNegativ

[Killed] Statement mutation
red/PensieCalculator/PensieLib/PensieLib.cs:13:21
             {
                 //conditie compusa
                 if (varstaCurenta < 0 || salariuLunar < 0 || aniCotizati < 0 || crestereAnualaSalariu <0) 
-                    throw new ArgumentException("Parametrii invalizi.");
+                    ;
                 
                 int aniRamasi = VarstaPensionare - varstaCurenta;
killedBy: PensieTests.CalculatorPensieTests.EP1_VarstaNegativa; PensieTests.CalculatorPensieTests.EP2_SalariuNegativ; PensieTests.CalculatorPensieTests.EP3_AniCotizatiNegativi

[Survived] String mutation
red/PensieCalculator/PensieLib/PensieLib.cs:13:49
             {
                 //conditie compusa
                 if (varstaCurenta < 0 || salariuLunar < 0 || aniCotizati < 0 || crestereAnualaSalariu <0) 
-                    throw new ArgumentException("Parametrii invalizi.");
+                    throw new ArgumentException("");
                 
                 int aniRamasi = VarstaPensionare - varstaCurenta;

[Killed] Arithmetic mutation
red/PensieCalculator/PensieLib/PensieLib.cs:15:33
                 if (varstaCurenta < 0 || salariuLunar < 0 || aniCotizati < 0 || crestereAnualaSalariu <0) 
                     throw new ArgumentException("Parametrii invalizi.");
                 
-                int aniRamasi = VarstaPensionare - varstaCurenta;
+                int aniRamasi = VarstaPensionare + varstaCurenta;
                 int totalAniCotizare = aniCotizati;
                 
killedBy: PensieTests.CalculatorPensieTests.EP5_VarstaPensionareExacta_AniRamasi0; PensieTests.CalculatorPensieTests.EP6_PestePensionare_AniRamasiNegativ; PensieTests.CalculatorPensieTests.EP7_StagiuSubMinim

[Killed] Equality mutation
red/PensieCalculator/PensieLib/PensieLib.cs:19:21
                 int totalAniCotizare = aniCotizati;
                 
                 //if fara else: varsta mai mare decat varsta de pensionare
-                if (aniRamasi > 0)
+                if (aniRamasi < 0)
                      totalAniCotizare = aniCotizati + aniRamasi;
 
killedBy: PensieTests.CalculatorPensieTests.EP6_PestePensionare_AniRamasiNegativ; PensieTests.CalculatorPensieTests.EP8_StagiuPartial; PensieTests.CalculatorPensieTests.EP9_StagiuComplet

[Killed] Negate expression
red/PensieCalculator/PensieLib/PensieLib.cs:19:21
                 int totalAniCotizare = aniCotizati;
                 
                 //if fara else: varsta mai mare decat varsta de pensionare
-                if (aniRamasi > 0)
+                if (!(aniRamasi > 0))
                      totalAniCotizare = aniCotizati + aniRamasi;
 
killedBy: PensieTests.CalculatorPensieTests.EP6_PestePensionare_AniRamasiNegativ; PensieTests.CalculatorPensieTests.EP8_StagiuPartial; PensieTests.CalculatorPensieTests.EP9_StagiuComplet

[Killed] Arithmetic mutation
red/PensieCalculator/PensieLib/PensieLib.cs:20:41
                 
                 //if fara else: varsta mai mare decat varsta de pensionare
                 if (aniRamasi > 0)
-                     totalAniCotizare = aniCotizati + aniRamasi;
+                     totalAniCotizare = aniCotizati - aniRamasi;
 
                 // if fara else: sub stagiul minim nu se acorda pensie
killedBy: PensieTests.CalculatorPensieTests.EP8_StagiuPartial; PensieTests.CalculatorPensieTests.EP9_StagiuComplet; PensieTests.CalculatorPensieTests.BVA2_TotalAni15_ExactMinim

[Killed] Negate expression
red/PensieCalculator/PensieLib/PensieLib.cs:23:21
                      totalAniCotizare = aniCotizati + aniRamasi;
 
                 // if fara else: sub stagiul minim nu se acorda pensie
-                if (totalAniCotizare < 15)
+                if (!(totalAniCotizare < 15))
                     return 0;
                 // puncte estimate din trecut (aproximare cu salariul curent)
killedBy: PensieTests.CalculatorPensieTests.EP5_VarstaPensionareExacta_AniRamasi0; PensieTests.CalculatorPensieTests.EP6_PestePensionare_AniRamasiNegativ; PensieTests.CalculatorPensieTests.EP7_StagiuSubMinim

[Killed] Equality mutation
red/PensieCalculator/PensieLib/PensieLib.cs:23:21
                      totalAniCotizare = aniCotizati + aniRamasi;
 
                 // if fara else: sub stagiul minim nu se acorda pensie
-                if (totalAniCotizare < 15)
+                if (totalAniCotizare > 15)
                     return 0;
                 // puncte estimate din trecut (aproximare cu salariul curent)
killedBy: PensieTests.CalculatorPensieTests.EP5_VarstaPensionareExacta_AniRamasi0; PensieTests.CalculatorPensieTests.EP6_PestePensionare_AniRamasiNegativ; PensieTests.CalculatorPensieTests.EP7_StagiuSubMinim

[Killed] Arithmetic mutation
red/PensieCalculator/PensieLib/PensieLib.cs:26:38
                 if (totalAniCotizare < 15)
                     return 0;
                 // puncte estimate din trecut (aproximare cu salariul curent)
-                double totalPuncte = aniCotizati * (salariuLunar / SalariuMediuEconomie);
+                double totalPuncte = aniCotizati / (salariuLunar / SalariuMediuEconomie);
 
                 // loop — simuleaza fiecare an ramas pana la pensionare
killedBy: PensieTests.CalculatorPensieTests.Mutant2_Salariu0; PensieTests.CalculatorPensieTests.Mutant5_salariuLunarSimulat

[Killed] Arithmetic mutation
red/PensieCalculator/PensieLib/PensieLib.cs:26:53
                 if (totalAniCotizare < 15)
                     return 0;
                 // puncte estimate din trecut (aproximare cu salariul curent)
-                double totalPuncte = aniCotizati * (salariuLunar / SalariuMediuEconomie);
+                double totalPuncte = aniCotizati * (salariuLunar * SalariuMediuEconomie);
 
                 // loop — simuleaza fiecare an ramas pana la pensionare
killedBy: PensieTests.CalculatorPensieTests.EP5_VarstaPensionareExacta_AniRamasi0; PensieTests.CalculatorPensieTests.EP6_PestePensionare_AniRamasiNegativ; PensieTests.CalculatorPensieTests.BVA6_AniRamasi1_Loop1

[Killed] Equality mutation
red/PensieCalculator/PensieLib/PensieLib.cs:30:33
 
                 // loop — simuleaza fiecare an ramas pana la pensionare
                 double salariuLunarSimulat = salariuLunar;
-                for (int i = 1; i <= aniRamasi; i++)
+                for (int i = 1; i < aniRamasi; i++)
                     {
                     double puncteAn = salariuLunarSimulat / SalariuMediuEconomie;
killedBy: PensieTests.CalculatorPensieTests.EP8_StagiuPartial; PensieTests.CalculatorPensieTests.EP9_StagiuComplet; PensieTests.CalculatorPensieTests.BVA2_TotalAni15_ExactMinim

[Timeout] PostIncrementExpression to PostDecrementExpression mutation
red/PensieCalculator/PensieLib/PensieLib.cs:30:49
 
                 // loop — simuleaza fiecare an ramas pana la pensionare
                 double salariuLunarSimulat = salariuLunar;
-                for (int i = 1; i <= aniRamasi; i++)
+                for (int i = 1; i <= aniRamasi; i--)
                     {
                     double puncteAn = salariuLunarSimulat / SalariuMediuEconomie;

[Killed] Arithmetic mutation
red/PensieCalculator/PensieLib/PensieLib.cs:32:39
                 double salariuLunarSimulat = salariuLunar;
                 for (int i = 1; i <= aniRamasi; i++)
                     {
-                    double puncteAn = salariuLunarSimulat / SalariuMediuEconomie;
+                    double puncteAn = salariuLunarSimulat * SalariuMediuEconomie;
                     totalPuncte += puncteAn;
                     
killedBy: PensieTests.CalculatorPensieTests.EP8_StagiuPartial; PensieTests.CalculatorPensieTests.EP9_StagiuComplet; PensieTests.CalculatorPensieTests.BVA2_TotalAni15_ExactMinim

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
red/PensieCalculator/PensieLib/PensieLib.cs:33:21
                 for (int i = 1; i <= aniRamasi; i++)
                     {
                     double puncteAn = salariuLunarSimulat / SalariuMediuEconomie;
-                    totalPuncte += puncteAn;
+                    totalPuncte -= puncteAn;
                     
                     // if fara else — bonus 5% pentru fiecare an de cotizare peste 35
killedBy: PensieTests.CalculatorPensieTests.EP8_StagiuPartial; PensieTests.CalculatorPensieTests.EP9_StagiuComplet; PensieTests.CalculatorPensieTests.BVA2_TotalAni15_ExactMinim

[Killed] Arithmetic mutation
red/PensieCalculator/PensieLib/PensieLib.cs:36:25
                     totalPuncte += puncteAn;
                     
                     // if fara else — bonus 5% pentru fiecare an de cotizare peste 35
-                    if (aniCotizati + i > 35)
+                    if (aniCotizati - i > 35)
                         totalPuncte += puncteAn * 0.05;
 
killedBy: PensieTests.CalculatorPensieTests.BVA4_TotalAni36_CuBonus; PensieTests.CalculatorPensieTests.BVA6_AniRamasi1_Loop1

[Killed] Negate expression
red/PensieCalculator/PensieLib/PensieLib.cs:36:25
                     totalPuncte += puncteAn;
                     
                     // if fara else — bonus 5% pentru fiecare an de cotizare peste 35
-                    if (aniCotizati + i > 35)
+                    if (!(aniCotizati + i > 35))
                         totalPuncte += puncteAn * 0.05;
 
killedBy: PensieTests.CalculatorPensieTests.EP8_StagiuPartial; PensieTests.CalculatorPensieTests.EP9_StagiuComplet; PensieTests.CalculatorPensieTests.BVA2_TotalAni15_ExactMinim

[Killed] Arithmetic mutation
red/PensieCalculator/PensieLib/PensieLib.cs:37:40
                     
                     // if fara else — bonus 5% pentru fiecare an de cotizare peste 35
                     if (aniCotizati + i > 35)
-                        totalPuncte += puncteAn * 0.05;
+                        totalPuncte += puncteAn / 0.05;
 
                     salariuLunarSimulat *= (1 + crestereAnualaSalariu / 100.0);
killedBy: PensieTests.CalculatorPensieTests.BVA4_TotalAni36_CuBonus; PensieTests.CalculatorPensieTests.BVA6_AniRamasi1_Loop1

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
red/PensieCalculator/PensieLib/PensieLib.cs:37:25
                     
                     // if fara else — bonus 5% pentru fiecare an de cotizare peste 35
                     if (aniCotizati + i > 35)
-                        totalPuncte += puncteAn * 0.05;
+                        totalPuncte -= puncteAn * 0.05;
 
                     salariuLunarSimulat *= (1 + crestereAnualaSalariu / 100.0);
killedBy: PensieTests.CalculatorPensieTests.BVA4_TotalAni36_CuBonus; PensieTests.CalculatorPensieTests.BVA6_AniRamasi1_Loop1

[Killed] MultiplyAssignmentExpression to DivideAssignmentExpression mutation
red/PensieCalculator/PensieLib/PensieLib.cs:39:21
                     if (aniCotizati + i > 35)
                         totalPuncte += puncteAn * 0.05;
 
-                    salariuLunarSimulat *= (1 + crestereAnualaSalariu / 100.0);
+                    salariuLunarSimulat /= (1 + crestereAnualaSalariu / 100.0);
                     }
                     
killedBy: PensieTests.CalculatorPensieTests.Mutant6_7_8_salariuLunarSimulat

[Killed] Arithmetic mutation
red/PensieCalculator/PensieLib/PensieLib.cs:39:49
                     if (aniCotizati + i > 35)
                         totalPuncte += puncteAn * 0.05;
 
-                    salariuLunarSimulat *= (1 + crestereAnualaSalariu / 100.0);
+                    salariuLunarSimulat *= (1 + crestereAnualaSalariu * 100.0);
                     }
                     
killedBy: PensieTests.CalculatorPensieTests.Mutant6_7_8_salariuLunarSimulat

[Killed] Equality mutation
red/PensieCalculator/PensieLib/PensieLib.cs:43:17
                     }
                     
             // if cu else: pensie completa sau redusa
-            if (totalAniCotizare >= 35)
+            if (totalAniCotizare < 35)
                 return totalPuncte * ValoarePunctPensie;
             else
killedBy: PensieTests.CalculatorPensieTests.EP5_VarstaPensionareExacta_AniRamasi0; PensieTests.CalculatorPensieTests.EP6_PestePensionare_AniRamasiNegativ; PensieTests.CalculatorPensieTests.EP8_StagiuPartial

[Killed] Negate expression
red/PensieCalculator/PensieLib/PensieLib.cs:43:17
                     }
                     
             // if cu else: pensie completa sau redusa
-            if (totalAniCotizare >= 35)
+            if (!(totalAniCotizare >= 35))
                 return totalPuncte * ValoarePunctPensie;
             else
killedBy: PensieTests.CalculatorPensieTests.EP5_VarstaPensionareExacta_AniRamasi0; PensieTests.CalculatorPensieTests.EP6_PestePensionare_AniRamasiNegativ; PensieTests.CalculatorPensieTests.EP8_StagiuPartial

[Killed] Arithmetic mutation
red/PensieCalculator/PensieLib/PensieLib.cs:44:24
                     
             // if cu else: pensie completa sau redusa
             if (totalAniCotizare >= 35)
-                return totalPuncte * ValoarePunctPensie;
+                return totalPuncte / ValoarePunctPensie;
             else
                 return totalPuncte * ValoarePunctPensie * 0.75;
killedBy: PensieTests.CalculatorPensieTests.EP5_VarstaPensionareExacta_AniRamasi0; PensieTests.CalculatorPensieTests.EP6_PestePensionare_AniRamasiNegativ; PensieTests.CalculatorPensieTests.EP9_StagiuComplet

[Killed] Arithmetic mutation
red/PensieCalculator/PensieLib/PensieLib.cs:46:24
             if (totalAniCotizare >= 35)
                 return totalPuncte * ValoarePunctPensie;
             else
-                return totalPuncte * ValoarePunctPensie * 0.75;
+                return totalPuncte * ValoarePunctPensie / 0.75;
           }
             
killedBy: PensieTests.CalculatorPensieTests.EP8_StagiuPartial; PensieTests.CalculatorPensieTests.BVA2_TotalAni15_ExactMinim; PensieTests.CalculatorPensieTests.BVA5_TotalAni34_PensieRedusa

[Killed] Arithmetic mutation
red/PensieCalculator/PensieLib/PensieLib.cs:46:24
             if (totalAniCotizare >= 35)
                 return totalPuncte * ValoarePunctPensie;
             else
-                return totalPuncte * ValoarePunctPensie * 0.75;
+                return totalPuncte / ValoarePunctPensie * 0.75;
           }
             
killedBy: PensieTests.CalculatorPensieTests.EP8_StagiuPartial; PensieTests.CalculatorPensieTests.BVA2_TotalAni15_ExactMinim; PensieTests.CalculatorPensieTests.BVA5_TotalAni34_PensieRedusa
